Enums/ПричиныПовторногоВводаКМВОборотИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПричиныПовторногоВводаКМВОборотИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Излишки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоДатыОбязательнойМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфискат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныПовторногоВводаКМВОборотИСМПТК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//БМ_ИСМПТ ТРЕБУЕТСЯ_РАССМОТРЕНИЕ	На текущий момент в схеме только один статус - 1, поэтому два других пока исключаем.
	СписокИсключений = Новый Массив;
	СписокИсключений.Добавить(Перечисления.ПричиныПовторногоВводаКМВОборотИСМПТК.ДоДатыОбязательнойМаркировки);
	СписокИсключений.Добавить(Перечисления.ПричиныПовторногоВводаКМВОборотИСМПТК.Конфискат);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ПричиныПовторногоВводаКМВОборотИСМПТК Цикл
		Если СписокИсключений.Найти(ЗначениеПеречисления) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
